GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_prcm.h
//*****************************************************************************
//
// Register: PRCM_O_PERBUSCPUCLKDIV
//
//*****************************************************************************
// Field: [3:0] RATIO
//
// Internal Register. Customers can control this through TI provided API
// ENUMs:
// DIV1                 Divide by 1
// DIV2                 Divide by 2
// DIV4                 Divide by 4
// DIV8                 Divide by 8
// DIV16                Divide by 16
// DIV32                Divide by 32
// DIV64                Divide by 64
// DIV128               Divide by 128
// DIV256               Divide by 256
//
#define PRCM_PERBUSCPUCLKDIV_RATIO_M                                0x0000000F
#define PRCM_PERBUSCPUCLKDIV_RATIO_S                                0
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV1                             0x00000000
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV2                             0x00000001
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV4                             0x00000002
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV8                             0x00000003
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV16                            0x00000004
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV32                            0x00000005
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV64                            0x00000006
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV128                           0x00000007
#define PRCM_PERBUSCPUCLKDIV_RATIO_DIV256                           0x00000008

//*****************************************************************************
//
// Register: PRCM_O_PERDMACLKDIV
//
//*****************************************************************************
// Field: [3:0] RATIO
//
// Internal Register. Customers can control this through TI provided API
// ENUMs:
// DIV1                 Divide by 1
// DIV2                 Divide by 2
// DIV4                 Divide by 4
// DIV8                 Divide by 8
// DIV16                Divide by 16
// DIV32                Divide by 32
// DIV64                Divide by 64
// DIV128               Divide by 128
// DIV256               Divide by 256
//
#define PRCM_PERDMACLKDIV_RATIO_M                                   0x0000000F
#define PRCM_PERDMACLKDIV_RATIO_S                                   0
#define PRCM_PERDMACLKDIV_RATIO_DIV1                                0x00000000
#define PRCM_PERDMACLKDIV_RATIO_DIV2                                0x00000001
#define PRCM_PERDMACLKDIV_RATIO_DIV4                                0x00000002
#define PRCM_PERDMACLKDIV_RATIO_DIV8                                0x00000003
#define PRCM_PERDMACLKDIV_RATIO_DIV16                               0x00000004
#define PRCM_PERDMACLKDIV_RATIO_DIV32                               0x00000005
#define PRCM_PERDMACLKDIV_RATIO_DIV64                               0x00000006
#define PRCM_PERDMACLKDIV_RATIO_DIV128                              0x00000007
#define PRCM_PERDMACLKDIV_RATIO_DIV256                              0x00000008

//*****************************************************************************
//
// Register: PRCM_O_I2SBCLKSEL
//
//*****************************************************************************
// Field: [0]    SRC
//
// BCLK source selector
//
// 0: Use external BCLK
// 1: Use internally generated clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SBCLKSEL_SRC                                         0x00000001
#define PRCM_I2SBCLKSEL_SRC_BITN                                    0
#define PRCM_I2SBCLKSEL_SRC_M                                       0x00000001
#define PRCM_I2SBCLKSEL_SRC_S                                       0

//*****************************************************************************
//
// Register: PRCM_O_GPTCLKDIV
//
//*****************************************************************************
// Field: [3:0] RATIO
//
// Scalar used for GPTs. The division rate will be constant and ungated for Run /
// Sleep / DeepSleep mode when it is slower than the PERBUSCPUCLKDIV.RATIO
// setting. When set faster than PERBUSCPUCLKDIV.RATIO setting the
// PERBUSCPUCLKDIV.RATIO will be used.
// Note that the register will contain the written content even though the
// setting is faster than PERBUSCPUCLKDIV.RATIO setting.
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// Other values are not supported.
//
//
// ENUMs:
// DIV1                 Divide by 1
// DIV2                 Divide by 2
// DIV4                 Divide by 4
// DIV8                 Divide by 8
// DIV16                Divide by 16
// DIV32                Divide by 32
// DIV64                Divide by 64
// DIV128               Divide by 128
// DIV256               Divide by 256
//
#define PRCM_GPTCLKDIV_RATIO_M                                      0x0000000F
#define PRCM_GPTCLKDIV_RATIO_S                                      0
#define PRCM_GPTCLKDIV_RATIO_DIV1                                   0x00000000
#define PRCM_GPTCLKDIV_RATIO_DIV2                                   0x00000001
#define PRCM_GPTCLKDIV_RATIO_DIV4                                   0x00000002
#define PRCM_GPTCLKDIV_RATIO_DIV8                                   0x00000003
#define PRCM_GPTCLKDIV_RATIO_DIV16                                  0x00000004
#define PRCM_GPTCLKDIV_RATIO_DIV32                                  0x00000005
#define PRCM_GPTCLKDIV_RATIO_DIV64                                  0x00000006
#define PRCM_GPTCLKDIV_RATIO_DIV128                                 0x00000007
#define PRCM_GPTCLKDIV_RATIO_DIV256                                 0x00000008

//*****************************************************************************
//
// Register: PRCM_O_I2SCLKCTL
//
//*****************************************************************************
// Field: [3]    SMPL_ON_POSEDGE
//
// On the I2S serial interface, data and WCLK is sampled and clocked out on
// opposite edges of BCLK.
//
// 0 - data and WCLK are sampled on the negative edge and clocked out on the
// positive edge.
// 1 - data and WCLK are sampled on the positive edge and clocked out on the
// negative edge.
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SCLKCTL_SMPL_ON_POSEDGE                              0x00000008
#define PRCM_I2SCLKCTL_SMPL_ON_POSEDGE_BITN                         3
#define PRCM_I2SCLKCTL_SMPL_ON_POSEDGE_M                            0x00000008
#define PRCM_I2SCLKCTL_SMPL_ON_POSEDGE_S                            3

