GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_prcm.h
// Field: [2:1] WCLK_PHASE
//
// Decides how the WCLK division ratio is calculated and used to generate different
// duty cycles (See I2SWCLKDIV.WDIV).
//
// 0: Single phase
// 1: Dual phase
// 2: User Defined
// 3: Reserved/Undefined
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
//
#define PRCM_I2SCLKCTL_WCLK_PHASE_M                                 0x00000006
#define PRCM_I2SCLKCTL_WCLK_PHASE_S                                 1

// Field: [0]    EN
//
//
// 0: MCLK, BCLK and WCLK will be static low
// 1: Enables the generation of  MCLK, BCLK and WCLK
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SCLKCTL_EN                                           0x00000001
#define PRCM_I2SCLKCTL_EN_BITN                                      0
#define PRCM_I2SCLKCTL_EN_M                                         0x00000001
#define PRCM_I2SCLKCTL_EN_S                                         0

//*****************************************************************************
//
// Register: PRCM_O_I2SMCLKDIV
//
//*****************************************************************************
// Field: [9:0] MDIV
//
// An unsigned factor of the division ratio used to generate MCLK [2-1024]:
//
// MCLK = MCUCLK/MDIV[Hz]
// MCUCLK is 48MHz in normal mode. For powerdown mode the frequency is defined
// by AON_WUC:MCUCLK.PWR_DWN_SRC
//
// A value of 0 is interpreted as 1024.
// A value of 1 is invalid.
// If MDIV is odd the low phase of the clock is one MCUCLK period longer than
// the high phase.
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SMCLKDIV_MDIV_M                                      0x000003FF
#define PRCM_I2SMCLKDIV_MDIV_S                                      0

//*****************************************************************************
//
// Register: PRCM_O_I2SBCLKDIV
//
//*****************************************************************************
// Field: [9:0] BDIV
//
// An unsigned factor of the division ratio used to generate I2S BCLK [2-1024]:
//
// BCLK = MCUCLK/BDIV[Hz]
// MCUCLK is 48MHz in normal mode. For powerdown mode the frequency is defined
// by AON_WUC:MCUCLK.PWR_DWN_SRC
//
// A value of 0 is interpreted as 1024.
// A value of 1 is invalid.
// If BDIV is odd and I2SCLKCTL.SMPL_ON_POSEDGE = 0, the low phase of the
// clock is one MCUCLK period longer than the high phase.
// If BDIV is odd and I2SCLKCTL.SMPL_ON_POSEDGE = 1 , the high phase of the
// clock is one MCUCLK period longer than the low phase.
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SBCLKDIV_BDIV_M                                      0x000003FF
#define PRCM_I2SBCLKDIV_BDIV_S                                      0

//*****************************************************************************
//
// Register: PRCM_O_I2SWCLKDIV
//
//*****************************************************************************
// Field: [15:0] WDIV
//
// If I2SCLKCTL.WCLK_PHASE = 0, Single phase.
// WCLK is high one BCLK period and low WDIV[9:0] (unsigned, [1-1023]) BCLK
// periods.
//
// WCLK = MCUCLK / BDIV*(WDIV[9:0] + 1) [Hz]
// MCUCLK is 48MHz in normal mode. For powerdown mode the frequency is defined
// by AON_WUC:MCUCLK.PWR_DWN_SRC
//
// If I2SCLKCTL.WCLK_PHASE = 1, Dual phase.
// Each phase on WCLK (50% duty cycle) is WDIV[9:0] (unsigned, [1-1023]) BCLK
// periods.
//
// WCLK = MCUCLK / BDIV*(2*WDIV[9:0]) [Hz]
//
// If I2SCLKCTL.WCLK_PHASE = 2, User defined.
// WCLK is high WDIV[7:0] (unsigned, [1-255]) BCLK periods and low WDIV[15:8]
// (unsigned, [1-255]) BCLK periods.
//
// WCLK = MCUCLK / (BDIV*(WDIV[7:0] + WDIV[15:8]) [Hz]
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SWCLKDIV_WDIV_M                                      0x0000FFFF
#define PRCM_I2SWCLKDIV_WDIV_S                                      0

//*****************************************************************************
//
// Register: PRCM_O_RESETSECDMA
//
//*****************************************************************************
// Field: [8]    DMA
//
// Write 1 to reset. HW cleared.
// Acess will only have effect when PERIPH power domain is on,
// PDSTAT0.PERIPH_ON = 1
// Before writing set FLASH:CFG.DIS_READACCESS = 1 to ensure the reset is not
// activated while executing from flash. This means one cannot execute from flash
// when using the SW reset.
#define PRCM_RESETSECDMA_DMA                                        0x00000100
#define PRCM_RESETSECDMA_DMA_BITN                                   8
#define PRCM_RESETSECDMA_DMA_M                                      0x00000100
#define PRCM_RESETSECDMA_DMA_S                                      8

// Field: [1]    TRNG
//
// Write 1 to reset. HW cleared.
// Acess will only have effect when PERIPH power domain is on,
// PDSTAT0.PERIPH_ON = 1
// Before writing set FLASH:CFG.DIS_READACCESS = 1 to ensure the reset is not
// activated while executing from flash. This means one cannot execute from flash
// when using the SW reset.
#define PRCM_RESETSECDMA_TRNG                                       0x00000002
#define PRCM_RESETSECDMA_TRNG_BITN                                  1
#define PRCM_RESETSECDMA_TRNG_M                                     0x00000002
#define PRCM_RESETSECDMA_TRNG_S                                     1

// Field: [0]    CRYPTO
//
// Write 1 to reset. HW cleared.
// Acess will only have effect when PERIPH power domain is on,
// PDSTAT0.PERIPH_ON = 1
// Before writing set FLASH:CFG.DIS_READACCESS = 1 to ensure the reset is not
// activated while executing from flash. This means one cannot execute from flash
// when using the SW reset.
#define PRCM_RESETSECDMA_CRYPTO                                     0x00000001
#define PRCM_RESETSECDMA_CRYPTO_BITN                                0
#define PRCM_RESETSECDMA_CRYPTO_M                                   0x00000001
#define PRCM_RESETSECDMA_CRYPTO_S                                   0

//*****************************************************************************
//
// Register: PRCM_O_RESETGPIO
//
//*****************************************************************************
// Field: [0]    GPIO
//
//
// 0: No action
// 1: Reset GPIO. HW cleared.
//
// Acess will only have effect when PERIPH power domain is on,
// PDSTAT0.PERIPH_ON = 1
// Before writing set FLASH:CFG.DIS_READACCESS = 1 to ensure the reset is not
// activated while executing from flash. This means one cannot execute from flash
// when using the SW reset.
#define PRCM_RESETGPIO_GPIO                                         0x00000001
#define PRCM_RESETGPIO_GPIO_BITN                                    0
#define PRCM_RESETGPIO_GPIO_M                                       0x00000001
#define PRCM_RESETGPIO_GPIO_S                                       0

//*****************************************************************************
//
// Register: PRCM_O_RESETGPT
//
//*****************************************************************************
// Field: [3:0] GPT
//
//
// 0: No action
// 1: Reset GPT. HW cleared.
//
// Acess will only have effect when PERIPH power domain is on,
// PDSTAT0.PERIPH_ON = 1
// Before writing set FLASH:CFG.DIS_READACCESS = 1 to ensure the reset is not
// activated while executing from flash. This means one cannot execute from flash
// when using the SW reset.
// ENUMs:
// GPT0                 Reset GPT0
// GPT1                 Reset GPT1
// GPT2                 Reset GPT2
// GPT3                 Reset GPT3
//
#define PRCM_RESETGPT_GPT_M                                         0x0000000F
#define PRCM_RESETGPT_GPT_S                                         0
#define PRCM_RESETGPT_GPT_GPT0                                      0x00000001
#define PRCM_RESETGPT_GPT_GPT1                                      0x00000002
#define PRCM_RESETGPT_GPT_GPT2                                      0x00000004
#define PRCM_RESETGPT_GPT_GPT3                                      0x00000008

//*****************************************************************************
//
// Register: PRCM_O_RESETI2C
//
//*****************************************************************************
// Field: [0]    I2C
//
//
// 0: No action
// 1: Reset I2C. HW cleared.
//
// Acess will only have effect when SERIAL power domain is on,
// PDSTAT0.SERIAL_ON = 1
// Before writing set FLASH:CFG.DIS_READACCESS = 1 to ensure the reset is not
// activated while executing from flash. This means one cannot execute from flash
// when using the SW reset.
#define PRCM_RESETI2C_I2C                                           0x00000001
#define PRCM_RESETI2C_I2C_BITN                                      0
#define PRCM_RESETI2C_I2C_M                                         0x00000001
#define PRCM_RESETI2C_I2C_S                                         0

//*****************************************************************************
//
// Register: PRCM_O_RESETUART
//
//*****************************************************************************
// Field: [0]    UART
//
//
// 0: No action
// 1: Reset UART. HW cleared.
//
// Acess will only have effect when SERIAL power domain is on,
// PDSTAT0.SERIAL_ON = 1
// Before writing set FLASH:CFG.DIS_READACCESS = 1 to ensure the reset is not
// activated while executing from flash. This means one cannot execute from flash
// when using the SW reset.
#define PRCM_RESETUART_UART                                         0x00000001
#define PRCM_RESETUART_UART_BITN                                    0
#define PRCM_RESETUART_UART_M                                       0x00000001
#define PRCM_RESETUART_UART_S                                       0

//*****************************************************************************
//
// Register: PRCM_O_RESETSSI
//
//*****************************************************************************
// Field: [1:0] SSI
//
// SSI 0:
//
// 0: No action
// 1: Reset SSI. HW cleared.
//
// Acess will only have effect when SERIAL power domain is on,
// PDSTAT0.SERIAL_ON = 1
// Before writing set FLASH:CFG.DIS_READACCESS = 1 to ensure the reset is not
// activated while executing from flash. This means one cannot execute from flash
// when using the SW reset.
//
// SSI 1:
//
// 0: No action
// 1: Reset SSI. HW cleared.
//
// Acess will only have effect when PERIPH power domain is on,
// PDSTAT0.PERIPH_ON = 1
// Before writing set FLASH:CFG.DIS_READACCESS = 1 to ensure the reset is not
// activated while executing from flash. This means one cannot execute from flash
// when using the SW reset.
#define PRCM_RESETSSI_SSI_M                                         0x00000003
#define PRCM_RESETSSI_SSI_S                                         0

//*****************************************************************************
//
// Register: PRCM_O_RESETI2S
//
//*****************************************************************************
// Field: [0]    I2S
//
//
// 0: No action
// 1: Reset module. HW cleared.
//
// Acess will only have effect when PERIPH power domain is on,
// PDSTAT0.PERIPH_ON = 1
// Before writing set FLASH:CFG.DIS_READACCESS = 1 to ensure the reset is not
// activated while executing from flash. This means one cannot execute from flash
// when using the SW reset.
#define PRCM_RESETI2S_I2S                                           0x00000001
#define PRCM_RESETI2S_I2S_BITN                                      0
#define PRCM_RESETI2S_I2S_M                                         0x00000001
#define PRCM_RESETI2S_I2S_S                                         0

//*****************************************************************************
//
// Register: PRCM_O_SWRESET
//
//*****************************************************************************
// Field: [2]    MCU
//
//
// 0: No action
// 1: Generates reset request to WUC to reset the entire MCU voltage domain.
// Request is cleared by HW.
//
// Everything in MCU voltage domain reset including PRCM itself
#define PRCM_SWRESET_MCU                                            0x00000004
#define PRCM_SWRESET_MCU_BITN                                       2
#define PRCM_SWRESET_MCU_M                                          0x00000004
#define PRCM_SWRESET_MCU_S                                          2

