GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_prcm.h
// Field: [1]    CPU_ON
//
//
// 0: CPU and BUS domain not accessible
// 1: CPU and BUS domains are both currently accessible
//
#define PRCM_PDSTAT1_CPU_ON                                         0x00000002
#define PRCM_PDSTAT1_CPU_ON_BITN                                    1
#define PRCM_PDSTAT1_CPU_ON_M                                       0x00000002
#define PRCM_PDSTAT1_CPU_ON_S                                       1

//*****************************************************************************
//
// Register: PRCM_O_PDSTAT1BUS
//
//*****************************************************************************
// Field: [0]    ON
//
// This is an alias for PDSTAT1.BUS_ON
#define PRCM_PDSTAT1BUS_ON                                          0x00000001
#define PRCM_PDSTAT1BUS_ON_BITN                                     0
#define PRCM_PDSTAT1BUS_ON_M                                        0x00000001
#define PRCM_PDSTAT1BUS_ON_S                                        0

//*****************************************************************************
//
// Register: PRCM_O_PDSTAT1RFC
//
//*****************************************************************************
// Field: [0]    ON
//
// This is an alias for PDSTAT1.RFC_ON
#define PRCM_PDSTAT1RFC_ON                                          0x00000001
#define PRCM_PDSTAT1RFC_ON_BITN                                     0
#define PRCM_PDSTAT1RFC_ON_M                                        0x00000001
#define PRCM_PDSTAT1RFC_ON_S                                        0

//*****************************************************************************
//
// Register: PRCM_O_PDSTAT1CPU
//
//*****************************************************************************
// Field: [0]    ON
//
// This is an alias for PDSTAT1.CPU_ON
#define PRCM_PDSTAT1CPU_ON                                          0x00000001
#define PRCM_PDSTAT1CPU_ON_BITN                                     0
#define PRCM_PDSTAT1CPU_ON_M                                        0x00000001
#define PRCM_PDSTAT1CPU_ON_S                                        0

//*****************************************************************************
//
// Register: PRCM_O_PDSTAT1VIMS
//
//*****************************************************************************
// Field: [0]    ON
//
// This is an alias for PDSTAT1.VIMS_MODE
#define PRCM_PDSTAT1VIMS_ON                                         0x00000001
#define PRCM_PDSTAT1VIMS_ON_BITN                                    0
#define PRCM_PDSTAT1VIMS_ON_M                                       0x00000001
#define PRCM_PDSTAT1VIMS_ON_S                                       0

//*****************************************************************************
//
// Register: PRCM_O_RFCMODESEL
//
//*****************************************************************************
// Field: [2:0] CURR
//
// Written by MCU - Outputs to RFC. Only modes permitted by RFCMODEHWOPT.AVAIL
// are writeable.
//
//
// ENUMs:
// MODE0                Select Mode 0
// MODE1                Select Mode 1
// MODE2                Select Mode 2
// MODE3                Select Mode 3
// MODE4                Select Mode 4
// MODE5                Select Mode 5
// MODE6                Select Mode 6
// MODE7                Select Mode 7
//
#define PRCM_RFCMODESEL_CURR_M                                      0x00000007
#define PRCM_RFCMODESEL_CURR_S                                      0
#define PRCM_RFCMODESEL_CURR_MODE0                                  0x00000000
#define PRCM_RFCMODESEL_CURR_MODE1                                  0x00000001
#define PRCM_RFCMODESEL_CURR_MODE2                                  0x00000002
#define PRCM_RFCMODESEL_CURR_MODE3                                  0x00000003
#define PRCM_RFCMODESEL_CURR_MODE4                                  0x00000004
#define PRCM_RFCMODESEL_CURR_MODE5                                  0x00000005
#define PRCM_RFCMODESEL_CURR_MODE6                                  0x00000006
#define PRCM_RFCMODESEL_CURR_MODE7                                  0x00000007

//*****************************************************************************
//
// Register: PRCM_O_RAMRETEN
//
//*****************************************************************************
// Field: [2]    RFC
//
//
// 0: Retention for RFC SRAM disabled
// 1: Retention for RFC SRAM enabled
//
#define PRCM_RAMRETEN_RFC                                           0x00000004
#define PRCM_RAMRETEN_RFC_BITN                                      2
#define PRCM_RAMRETEN_RFC_M                                         0x00000004
#define PRCM_RAMRETEN_RFC_S                                         2

// Field: [1:0] VIMS
//
//
// 0: Memory retention disabled
// 1: Memory retention enabled
//
// Bit 0: VIMS_TRAM
// Bit 1: VIMS_CRAM
//
// Legal modes depend on settings in VIMS:CTL.MODE and PDRETEN.VIMS
//
// PDRETEN.VIMS = 1
//
// 00: VIMS:CTL.MODE must be OFF before DEEPSLEEP is asserted - must be set to
// CACHE or SPLIT mode after waking up again
// 01: VIMS:CTL.MODE must be GPRAM before DEEPSLEEP is asserted. Must remain
// in GPRAM mode after wake up, alternatively select OFF mode first and then CACHE
// or SPILT mode.
// 10: Illegal mode
// 11: No restrictions
//
// PDRETEN.VIMS = 0
//
// 00: Special TI debug mode. Do not use.
// All others: Illegal modes.
//
#define PRCM_RAMRETEN_VIMS_M                                        0x00000003
#define PRCM_RAMRETEN_VIMS_S                                        0

//*****************************************************************************
//
// Register: PRCM_O_PDRETEN
//
//*****************************************************************************
// Field: [6]    PERIPH
//
//
// 0: Retention disabled
// 1: Retention enabled
//
#define PRCM_PDRETEN_PERIPH                                         0x00000040
#define PRCM_PDRETEN_PERIPH_BITN                                    6
#define PRCM_PDRETEN_PERIPH_M                                       0x00000040
#define PRCM_PDRETEN_PERIPH_S                                       6

// Field: [5]    SERIAL
//
// Domain not designed for retention. Writing this bit will have no effect.
#define PRCM_PDRETEN_SERIAL                                         0x00000020
#define PRCM_PDRETEN_SERIAL_BITN                                    5
#define PRCM_PDRETEN_SERIAL_M                                       0x00000020
#define PRCM_PDRETEN_SERIAL_S                                       5

// Field: [4]    RFC
//
// Domain not designed for retention. Writing this bit will have no effect.
#define PRCM_PDRETEN_RFC                                            0x00000010
#define PRCM_PDRETEN_RFC_BITN                                       4
#define PRCM_PDRETEN_RFC_M                                          0x00000010
#define PRCM_PDRETEN_RFC_S                                          4

